# Tap additional repositories
tap "ethancarlsson/openapi-to-hurl"  # For openapi-to-hurl tool
tap "hashicorp/tap"                  # For Terraform and other HashiCorp tools
tap "homebrew/bundle"                # For Homebrew bundle support

# -------------------
# Programming Languages and Runtimes
# -------------------
brew "mise"                          # Version manager for programming languages

# -------------------
# Terminal and Shell Enhancements
# -------------------
cask "kitty"                         # Fast, GPU-accelerated terminal emulator
cask "warp"                          # Modern, Rust-based terminal with AI features
brew "antidote"                      # Zsh plugin manager
brew "oh-my-posh"                    # Prompt theme engine for shells
brew "tmux"                          # Terminal multiplexer
brew "tpm"                           # Tmux plugin manager
brew "tmate"                         # Share terminal sessions
brew "zoxide"                        # Smart directory jumper
brew "eza"                           # Modern ls replacement
brew "bat"                           # Cat clone with syntax highlighting
brew "fzf"                           # Fuzzy finder for CLI
brew "tldr"                          # Simplified man pages
brew "thefuck"                       # Corrects previous command typos
brew "btop"                          # Resource monitor

# -------------------
# DevOps and Cloud Tools
# -------------------
cask "docker"                        # Container platform
cask "google-cloud-sdk"              # GCP CLI tools
brew "awscli"                        # AWS CLI
brew "azure-cli"                     # Azure CLI
brew "kubectl"                       # Kubernetes CLI
brew "kubectx"                       # Kubernetes context switcher
brew "k9s"                           # Kubernetes TUI
brew "helm"                          # Kubernetes package manager
brew "hashicorp/tap/terraform"       # Infrastructure as Code
brew "lazydocker"                    # Docker TUI
brew "temporal"                      # Workflow orchestration CLI

# -------------------
# Development Tools
# -------------------
brew "git"                           # Version control
brew "git-lfs"                       # Git Large File Storage
brew "git-delta"                     # Git diff viewer
brew "lazygit"                       # Git TUI
brew "gh"                            # GitHub CLI
brew "glab"                          # GitLab CLI
brew "chezmoi"                       # Dotfile manager
brew "vim"                           # Text editor
brew "neovim"                        # Modern Vim
brew "tree"                          # Directory tree viewer
brew "jq"                            # JSON processor
brew "yq"                            # YAML processor
brew "hurl"                          # HTTP request tester
brew "ethancarlsson/openapi-to-hurl/openapi-to-hurl"  # Convert OpenAPI to Hurl
brew "rbw"                           # Bitwarden CLI
brew "parallel"                      # Parallel command execution
brew "fd"                            # Fast find alternative
brew "ripgrep"                       # Fast grep alternative
brew "ghostscript"                   # PostScript/PDF interpreter (for document processing)

# -------------------
# Media and Content Tools
# -------------------
brew "ffmpeg"                        # Audio/video processing
brew "yt-dlp"                        # YouTube video downloader
cask "capcut"                        # Video editing software
cask "blender"                       # 3D creation suite
cask "obs"                           # Streaming/recording software
# Note: DaVinci Resolve not available via Homebrew; install manually

# -------------------
# Productivity Tools
# -------------------
cask "raycast"                       # Launcher and productivity tool
cask "homerow"                       # Keyboard navigation enhancer
cask "rectangle"                     # Window manager
cask "obsidian"                      # Knowledge base and note-taking
cask "bruno"                         # API client (alternative to Postman, complements hurl)
cask "dbeaver-community"             # SQL client and database admin

# -------------------
# IDEs and Editors
# -------------------
cask "visual-studio-code"            # Code editor
cask "cursor"                        # AI-powered code editor

# -------------------
# Browsers
# -------------------
cask "google-chrome"                 # Web browser
cask "vivaldi"                       # Customizable web browser

# -------------------
# Fonts
# -------------------
cask "font-jetbrains-mono-nerd-font" # Developer-friendly font with ligatures

# -------------------
# Networking
# -------------------
cask "tailscale"                     # Zero-config VPN
cask "keycastr"                      # Keystroke visualizer (useful for presentations)

# -------------------
# Databases
# -------------------
brew "postgresql@14"                 # PostgreSQL database

# -------------------
# File Navigation and Preview
# -------------------
brew "yazi"                          # Terminal file manager

# -------------------
# VS Code Extensions
# -------------------
vscode "asvetliakov.vscode-neovim"    # Neovim integration for VS Code
vscode "golang.go"                    # Go language support
vscode "kingwl.vscode-vitest-runner"  # Vitest test runner
vscode "ms-azuretools.vscode-docker"  # Docker support
vscode "ms-playwright.playwright"     # Playwright testing
vscode "ms-python.debugpy"            # Python debugger
vscode "ms-python.python"             # Python support
vscode "ms-python.vscode-pylance"     # Python language server
vscode "ms-vscode-remote.remote-containers"  # Dev containers
vscode "rust-lang.rust-analyzer"      # Rust language server
vscode "vitest.explorer"              # Vitest test explorer
