# Tap additional repositories
tap "ethancarlsson/openapi-to-hurl"  # For openapi-to-hurl tool
tap "hashicorp/tap"                  # For Terraform and other HashiCorp tools
tap "homebrew/bundle"                # For Homebrew bundle support

# -------------------
# Programming Languages and Runtimes
# -------------------
brew "mise"                          # Version manager for programming languages

# -------------------
# Terminal and Shell Enhancements
# -------------------
# cask "kitty"                       # Fast, GPU-accelerated terminal emulator
cask "ghostty"                       # Kitty doesn't support dictation
brew "antidote"                      # Zsh plugin manager
brew "tmux"                          # Terminal multiplexer
brew "tpm"                           # Tmux plugin manager
brew "zoxide"                        # Smart directory jumper
brew "eza"                           # Modern ls replacement
brew "bat"                           # Cat clone with syntax highlighting
brew "fzf"                           # Fuzzy finder for CLI
brew "tldr"                          # Simplified man pages
brew "btop"                          # Resource monitor

# -------------------
# Style
# -------------------
brew "oh-my-posh"                    # Prompt theme engine for shells
brew "lolcat"                        # Terminal text color

# -------------------
# DevOps and Cloud Tools (uncomment what you need)
# -------------------
# cask "docker"                        # Container platform
# cask "google-cloud-sdk"              # GCP CLI tools
# brew "awscli"                        # AWS CLI
# brew "azure-cli"                     # Azure CLI
# brew "kubectl"                       # Kubernetes CLI
# brew "kubectx"                       # Kubernetes context switcher
# brew "k9s"                           # Kubernetes TUI
# brew "helm"                          # Kubernetes package manager
# brew "hashicorp/tap/terraform"       # Infrastructure as Code
# brew "lazydocker"                    # Docker TUI
# brew "temporal"                      # Workflow orchestration CLI
brew "pumba"                           # Chaos engineering tool for Docker

# -------------------
# Development Tools
# -------------------
brew "git"                           # Version control
brew "git-lfs"                       # Git Large File Storage
brew "git-delta"                     # Git diff viewer
brew "lazygit"                       # Git TUI
brew "pre-commit"                    # Pre-commit hooks
brew "gh"                            # GitHub CLI
brew "glab"                          # GitLab CLI
brew "chezmoi"                       # Dotfile manager
brew "vim"                           # Text editor
brew "neovim"                        # Modern Vim
brew "tree"                          # Directory tree viewer
brew "jq"                            # JSON processor
brew "yq"                            # YAML processor
brew "hurl"                          # HTTP request tester
brew "rbw"                           # Bitwarden CLI
brew "parallel"                      # Parallel command execution
brew "fd"                            # Fast find alternative
brew "ripgrep"                       # Fast grep alternative
brew "websocat"                      # WS testing tool
brew "mprocs"

# -------------------
# Media and Content Tools
# -------------------
# brew "ffmpeg"                        # Audio/video processing
brew "yt-dlp"                        # YouTube video downloader
brew "pdfcpu"                        # CLI pdf editor
# cask "capcut"                        # Video editing software
# cask "blender"                       # 3D creation suite
# cask "obs"                           # Streaming/recording software
# Note: DaVinci Resolve not available via Homebrew; install manually

# -------------------
# Productivity Tools
# -------------------
cask "raycast"                       # Launcher and productivity tool
# cask "rectangle"                     # Window manager (Optional since raycast has similar features)
cask "obsidian"                      # Knowledge base and note-taking
# cask "hoppscotch"                    # API client (alternative to Postman, complements hurl)
# cask "dbeaver-community"             # SQL client and database admin

# -------------------
# IDEs and Editors
# -------------------
cask "visual-studio-code"            # Code editor
# cask "cursor"                        # AI-powered code editor
# npm install -g @anthropic-ai/claude-code
# brew codex

# -------------------
# Browsers
# -------------------
cask "google-chrome"                 # Web browser
cask "vivaldi"                       # Customizable web browser

# -------------------
# Fonts
# -------------------
cask "font-jetbrains-mono-nerd-font" # Developer-friendly font with ligatures

# -------------------
# Networking
# -------------------
# cask "tailscale"                     # Zero-config VPN
cask "keycastr"                      # Keystroke visualizer (useful for presentations)

# -------------------
# Databases
# -------------------
# brew "postgresql@14"                 # PostgreSQL database
brew "sqlite"                 # PostgreSQL database

# -------------------
# File Navigation and Preview
# -------------------
brew "yazi"                          # Terminal file manager

# -------------------
# VS Code Extensions (uncomment what you need)
# -------------------
vscode "vscodevim.vim"                # Vim integration for VS Code (Neovim is too buggy)
# vscode "golang.go"                    # Go language support
# vscode "rust-lang.rust-analyzer"      # Rust language server
# vscode "ms-playwright.playwright"     # Playwright testing
# vscode "ms-python.debugpy"            # Python debugger
# vscode "charliermarsh.ruff"           # Python linter (ruff)
# vscode "ms-python.python"             # Python support
# vscode "ms-python.vscode-pylance"     # Python language server
# vscode "kingwl.vscode-vitest-runner"  # Vitest test runner
# vscode "vitest.explorer"              # Vitest test explorer
# vscode "ms-azuretools.vscode-docker"  # Docker support (I frequently use Docker CLI instead)
